#include <iostream>
#include <vector>

int main() {
    int T;
    int N;

    // Запит користувача на введення числа T
    std::cout << "Введіть число T: ";
    std::cin >> T;

    // Запит користувача на введення розміру масиву
    std::cout << "Введіть розмір масиву: ";
    std::cin >> N;

    // Перевірка на коректність введеного розміру
    if (N <= 0) {
        std::cout << "Некоректний розмір масиву. Розмір повинен бути більшим за 0." << std::endl;
        return 1;
    }

    // Оголошення та ініціалізація масиву розміру N
    std::vector<int> A(N);

    // Зчитування елементів масиву з консолі
    for (int i = 0; i < N; ++i) {
        std::cout << "Введіть елемент масиву A[" << i << "]: ";
        std::cin >> A[i];
    }

    int maxN = INT_MIN; // Ініціалізуємо максимальний від'ємний елемент
    int maxNIndex = -1; // Ініціалізуємо індекс максимального від'ємного елемента

    // Знаходження номера першого елемента, більшого за T
    for (int i = 0; i < N; ++i) {
        if (A[i] > T) {
            break; // Вийти з циклу, коли знайдено елемент, більший за T
        }

        if (A[i] < 0 && A[i] > maxN) {
            maxN = A[i];
            maxNIndex = i;
        }
    }

    // Виведення результату
    if (maxNIndex != -1) {
        std::cout << "Номер першого максимального від'ємного елемента: " << maxNIndex << std::endl;
    }
    else {
        std::cout << "У масиві немає від'ємних елементів перед першим елементом, більшим за " << T << std::endl;
    }

    return 0;
}
