#include <iostream>

int main() {
    int N;

    // Запит користувача на введення розміру масиву
    std::cout << "Введіть розмір масиву: ";
    std::cin >> N;

    // Перевірка на коректність введеного розміру
    if (N <= 0) {
        std::cout << "Некоректний розмір масиву. Розмір повинен бути більшим за 0." << std::endl;
        return 1;
    }

    // Оголошення та ініціалізація масиву розміру N
    int A[N];

    // Зчитування елементів масиву з консолі
    for (int i = 0; i < N; ++i) {
        std::cout << "Введіть елемент масиву A[" << i << "]: ";
        std::cin >> A[i];
    }

    // Знайдемо серед всіх додатних мінімальний елемент та його індекс
    int minP = -1; // Ініціалізуємо мінімальний додатний елемент -1 (не знайдено)
    int minPIndex = -1; // Ініціалізуємо індекс -1 (не знайдено)

    for (int i = 0; i < N; ++i) {
        if (A[i] > 0) {
            if (minP == -1 || A[i] < minP) {
                minP = A[i];
                minPIndex = i;
            }
        }
    }

    // Виведення результату
    if (minPIndex != -1) {
        std::cout << "Мінімальний додатний елемент масиву: " << minP << std::endl;
        std::cout << "Індекс мінімального додатнього елемента: " << minPIndex << std::endl;
    }
    else {
        std::cout << "У масиві немає додатних елементів." << std::endl;
    }

    return 0;
}
